MOVE '#1' TO GX-ODBF-FILE
MOVE '#2' TO GX-ODBF-TOFILE
MOVE '#3' TO GX-ODBF-SHARE
MOVE '#4' TO GX-ODBF-WAITRCD
MOVE '#5' TO GX-ODBF-LVLCHK
MOVE GX-OVRDBF TO GX-QCMDEXC-CMD
MOVE 110 TO GX-QCMDEXC-CMDLEN
CALL 'QCMDEXC' USING GX-QCMDEXC-CMD
                     GX-QCMDEXC-CMDLEN
