PERFORM TEST AFTER UNTIL GX-IO-CODE NOT LESS ZERO
   START #1 KEY IS #2
                       #3
      INVALID KEY
         CONTINUE
   END-START
   PERFORM GX-FILE-STATUS-ANALYSIS
   PERFORM GX-IOERR-LOOP
END-PERFORM

