 CREATE-A-TABLE.

     CALL 'GXSEXCCMD' USING GX-SQL-STATEMENT.

 CREATE-AN-INDEX.

     CALL 'GXSEXCCMD' USING GX-SQL-STATEMENT.

 DROP-A-TABLE.
 
     MOVE SPACES TO GX-SQL-STATEMENT
     STRING 'DROP INDEX '  DELIMITED BY SIZE
            GX-APPLIB      DELIMITED BY SPACE
            '/'            DELIMITED BY SIZE
            GX-OBJECT-NAME DELIMITED BY SPACE INTO GX-SQL-STATEMENT
     CALL 'GXSEXCCMD' USING GX-SQL-STATEMENT.

 DROP-AN-INDEX.
 
     MOVE SPACES TO GX-SQL-STATEMENT
     STRING 'DROP INDEX '    DELIMITED BY SIZE
            GX-OBJECT-NAME-Q DELIMITED BY SPACE INTO GX-SQL-STATEMENT
     CALL 'GXSEXCCMD' USING GX-SQL-STATEMENT.
 
