MOVE SPACES                 TO GX-QCMDEXC-CMD
STRING 'CLOF OPNID(#1)' DELIMITED BY SIZE
                          INTO GX-QCMDEXC-CMD
MOVE 40                     TO GX-QCMDEXC-CMDLEN
CALL 'QCMDEXC' USING GX-QCMDEXC-CMD
                     GX-QCMDEXC-CMDLEN
CLOSE #2
