01  GX-COUNT-FLD          PIC S9(0008) COMP-3.
01  GX-APPLIB             PIC  X(0010).
01  GX-OBJECT-NAME        PIC  X(0010).
01  GX-MEMBER-NAME        PIC  X(0010).
01  GX-OBJECT-NAME-Q      PIC  X(0021).
01  GX-NEW-OBJECT-NAME    PIC  X(0010).
01  GX-SQL-STATEMENT      PIC  X(3000).
