01  GX-APPLIB             PIC X(10).
01  GX-OBJECT-NAME        PIC X(10).
01  GX-OBJECT-NAME-Q      PIC X(21).
01  GX-NEW-OBJECT-NAME    PIC X(10).
01  GX-SQL-STATEMENT      PIC X(150).
