SET UPDATE-MODE TO TRUE
MOVE 0 TO GX-LCHK
MOVE 0 TO GX-CHK-OR-LD
PERFORM #1
IF NO-ERRORS-FOUND
   PERFORM #2
      THRU #3
   IF NO-ERRORS-FOUND
      SET DISPLAY-MODE TO TRUE
      PERFORM #4
   END-IF
   PERFORM #5
END-IF
SET DISPLAY-MODE TO TRUE
PERFORM #6
