PERFORM #1
IF MORE-SFL-REC
   SET RECORD-HAS-NO-ERRORS TO TRUE
   SET RECORD-NOT-PROTECTED TO TRUE
   SET MODIFIED-MARK-OFF    TO TRUE
   IF INSERT-MODE
      PERFORM #2
      PERFORM #3
      PERFORM #13 
         THRU #14
      IF NO-ERRORS-FOUND
         PERFORM #4
         SET RECORD-PROTECTED TO TRUE
      END-IF
   END-IF
   IF UPDATE-MODE
      PERFORM #5
      PERFORM #6
      PERFORM #3
      PERFORM #13 
         THRU #14
      IF NO-ERRORS-FOUND
         PERFORM #7
      END-IF
   END-IF
   IF DELETE-MODE
      PERFORM #5
      PERFORM #13 
         THRU #14
      IF NO-ERRORS-FOUND
         PERFORM #9
         MOVE '*' TO GX-SUBFILE-OPTION
         SET RECORD-PROTECTED TO TRUE
      END-IF
   END-IF
   IF NO-ERRORS-FOUND
      PERFORM #10
      PERFORM #11
      PERFORM #12
   END-IF
