 SQL-DROP-TABLE.
 
     MOVE SPACES TO GX-SQL-STATEMENT
     STRING 'DROP TABLE '    DELIMITED BY SIZE
            GX-OBJECT-NAME-Q DELIMITED BY SPACE INTO GX-SQL-STATEMENT
 
     EXEC SQL
        EXECUTE IMMEDIATE :GX-SQL-STATEMENT
     END-EXEC.
 
 SQL-DROP-INDEX.
 
     MOVE SPACES TO GX-SQL-STATEMENT
     STRING 'DROP INDEX '    DELIMITED BY SIZE
            GX-OBJECT-NAME-Q DELIMITED BY SPACE INTO GX-SQL-STATEMENT
 
     EXEC SQL
        EXECUTE IMMEDIATE :GX-SQL-STATEMENT
     END-EXEC.

