IF #1 EQUAL ZEROES AND
   NOT INSERT-MODE

   MOVE #2 TO MSG-DESCRIPTION
   PERFORM SEND-ERROR-MSG-WS
   SET CANCEL-KEY-ON TO TRUE
   PERFORM INSERT-MODE-SETUP
END-IF
PERFORM #3
