RPT-CHECK-EOP.

    SET RPT-RCDS-FOUND TO TRUE
    IF #1 + W-LINES-TO-ADVANCE GREATER 
       RPT-PAGE-LENGTH - RPT-BOTTOM-MARGIN

       COMPUTE W-LINES-TO-ADVANCE = RPT-PAGE-LENGTH -
                                    RPT-BOTTOM-MARGIN -
                                    #1
       SET RPT-HEADER-ON TO TRUE
       SET RPT-NOT-FIRST-PAGE TO TRUE
    END-IF

    EVALUATE TRUE
       WHEN W-LINES-TO-ADVANCE NOT GREATER 0
          MOVE 0 TO RPT-LINES-TO-ADVANCE
          PERFORM RPT-PRINT-LINE
       WHEN OTHER
          MOVE 1 TO RPT-LINES-TO-ADVANCE
          PERFORM RPT-PRINT-LINE
          SUBTRACT 1 FROM W-LINES-TO-ADVANCE
          MOVE SPACES TO W-LINE-TO-PRINT
          PERFORM RPT-PRINT-LINE W-LINES-TO-ADVANCE TIMES
    END-EVALUATE
    CONTINUE.

RPT-PRINT-LINE.

    WRITE GX-PRN-RECORD FROM W-LINE-TO-PRINT
          BEFORE ADVANCING RPT-LINES-TO-ADVANCE LINES
    ADD RPT-LINES-TO-ADVANCE TO #1

    CONTINUE.
