IF INSERT-MODE OR
   UPDATE-MODE OR
   (DELETE-MODE AND
    GX-SUBFILE-OPTION NOT EQUAL SPACES)

   SET MODIFIED-MARK-ON
       RECORD-PROCESSED TO TRUE
END-IF
