01  V-FS                     PIC  XX.
01  GX-IO-CODE               PIC S9(0004) COMP-3.
    88 GX-IO-EOF                                 VALUE  100.
    88 GX-IO-LOCKED-FILE                         VALUE -001.
    88 GX-IO-LOCKED-RCD                          VALUE -002.
    88 GX-IO-DUP-KEY                             VALUE -003.
    88 GX-IO-BAD-RCD-LEN                         VALUE -004.
    88 GX-IO-MISSING-READ                        VALUE -005.
    88 GX-IO-OTHER-ERRORS                        VALUE -999.
    88 GX-RCD-FOUND                              VALUE    0.
    88 GX-IO-OK                                  VALUE    0.
