
PERFORM LOOKUP-MODE-SETUP
SET     LOOKUP-AVAILABLE
        SELECTION-NOT-DISPLAYED TO TRUE
MOVE    #3 TO #2
PERFORM #1
   THRU #4
  UNTIL CANCEL-KEY-ON       OR
        SELECTION-DISPLAYED
MOVE    #2 TO #3
