GX-READ-DTIME-FIELD.
    IF YY OF GX-INT-FMT-DTIME = 1 AND
       MM OF GX-INT-FMT-DTIME = 1 AND
       DD OF GX-INT-FMT-DTIME = 1
       MOVE 0 TO YY OF GX-INT-FMT-DTIME
                 MM OF GX-INT-FMT-DTIME
                 DD OF GX-INT-FMT-DTIME
    END-IF.
