
IF UPDATE-MODE OR
   (INSERT-MODE AND
    GX-SFLRECNBR = #1)

   MOVE    GX-SFLRECNBR           TO GX-SFLRELRECNBR
                                     #2
   PERFORM #7
   PERFORM CLR-SCREEN

   PERFORM LOOKUP-MODE-SETUP
   SET     SELECTION-NOT-DISPLAYED
           MODIFIED-MARK-OFF       TO TRUE
   MOVE    #5 TO #4
   PERFORM #3 THRU
           #11
     UNTIL CANCEL-KEY-ON       OR
           SELECTION-DISPLAYED
   MOVE    #4 TO #5
   MOVE #6 TO GX-STATUS-VARIABLES
   MOVE #2 TO GX-SFLRELRECNBR
   SET  LOOKUP-AVAILABLE        TO TRUE
   IF CANCEL-KEY-OFF
      MOVE #10 TO #9
      PERFORM #7
      MOVE #9 TO #10

      SET MODIFIED-MARK-ON     TO TRUE
      PERFORM #8
      SET MODIFIED-MARK-OFF    TO TRUE
   END-IF
END-IF
