GX-WRITE-DTIME-FIELD.
    IF YY OF GX-INT-FMT-DTIME = 0 AND
       MM OF GX-INT-FMT-DTIME = 0 AND
       DD OF GX-INT-FMT-DTIME = 0
       MOVE 1 TO YY OF GX-INT-FMT-DTIME
                 MM OF GX-INT-FMT-DTIME
                 DD OF GX-INT-FMT-DTIME
    END-IF
    MOVE CORR GX-INT-FMT-DTIME TO GX-EXT-DTIME
    MOVE '-'  TO GX-EXT-DTIME-S1 OF GX-EXT-DTIME
                 GX-EXT-DTIME-S2 OF GX-EXT-DTIME
                 GX-EXT-DTIME-S3 OF GX-EXT-DTIME
    MOVE '.'  TO GX-EXT-DTIME-D1 OF GX-EXT-DTIME
                 GX-EXT-DTIME-D2 OF GX-EXT-DTIME
                 GX-EXT-DTIME-D3 OF GX-EXT-DTIME
    MOVE ZERO TO MS OF GX-EXT-DTIME.
