01  W-LINE-TO-PRINT       PIC  X(300)        VALUE SPACES.
01  W-LINES-TO-ADVANCE    PIC S9(003) COMP-3 VALUE 0.
01  RPT-PAGE-LENGTH       PIC S9(003) COMP-3 VALUE 0.
01  RPT-TOP-MARGIN        PIC S9(003) COMP-3 VALUE 0.
01  RPT-BOTTOM-MARGIN     PIC S9(003) COMP-3 VALUE 0.
01  RPT-PRNCMD-STRUC.
    05  RPT-PRNCMD-LINE   PIC  X(300)        VALUE SPACES.
    05  RPT-PRNCMD-PTR    PIC S9(003) COMP-3 VALUE 1.
    05  RPT-PRNCMD-INT    PIC  9(003) BINARY VALUE 0.
    05  FILLER REDEFINES RPT-PRNCMD-INT.
        10 FILLER         PIC  X(001).
        10 RPT-PRNCMD-CHR PIC  X(001).
01  RPT-LINES-TO-ADVANCE  PIC S9(003) COMP-3 VALUE ZERO.
01  RPT-W-LINE-COUNTER    PIC S9(003) COMP-3 VALUE 1.
01  FILLER                PIC S9(001) COMP-3 VALUE 1.
    88 RPT-NO-RCDS-FOUND                     VALUE 1.
    88 RPT-RCDS-FOUND                        VALUE 0.
01  FILLER                PIC S9(001) COMP-3 VALUE 1.
    88 RPT-HEADER-ON                         VALUE 0.
    88 RPT-HEADER-OFF                        VALUE 1.
01  FILLER                PIC S9(001) COMP-3 VALUE 1.
    88 RPT-FIRST-PAGE                        VALUE 0.
    88 RPT-NOT-FIRST-PAGE                    VALUE 1.
01  RPT-NO-RCDS-FOUND-MSG PIC  X(080)        VALUE
                          '#1'.
