IF NO-ERRORS-FOUND
  IF INSERT-MODE
     PERFORM #1
  END-IF
  IF UPDATE-MODE
     PERFORM #2
  END-IF
  IF DELETE-MODE
     PERFORM #3
  END-IF
  PERFORM #4
  PERFORM #5
END-IF
SET NO-MORE-SFL-REC TO TRUE
