 PROCESS 
         #6
         APOST.
 IDENTIFICATION DIVISION.
 
 PROGRAM-ID.               #1.
* Description: #7
 AUTHOR.                   GENEXUS #2
                           FOR #3.
 DATE-WRITTEN.             #4.
 
 
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SOURCE-COMPUTER.          IBM-AS400.
 OBJECT-COMPUTER.          IBM-AS400.
 SPECIAL-NAMES.            I-O-FEEDBACK IS DISPLAY-FEEDBACK
                           #5

 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
