SET DISPLAY-SFLCTL TO TRUE
IF #1 GREATER 0
   SET DISPLAY-SFL    TO TRUE
ELSE
   SET NO-DISPLAY-SFL TO TRUE
END-IF
IF GX-LREC = 1
   SET SFL-END TO TRUE
ELSE
   SET NO-SFL-END TO TRUE
END-IF
MOVE GX-SFLRECNBR TO SFLRCD OF #2
