GX-SFL-ACTRCD.
    IF WS-FIRST-SFL-REC = 0
       MOVE GX-SFL-RCDCNT TO WS-FIRST-SFL-REC
    END-IF
    MOVE 3 TO #1
    MOVE #3 TO #2
    EVALUATE TRUE    
    WHEN WS-ROW-POS < GX-SFL-UR
       MOVE WS-FIRST-SFL-REC TO GX-SFLRECNBR
    WHEN WS-ROW-POS > GX-SFL-LR OR
         WS-FIRST-SFL-REC + WS-ROW-POS - GX-SFL-UR > GX-SFL-RCDCNT
       MOVE GX-SFL-RCDCNT    TO GX-SFLRECNBR
    WHEN OTHER
       COMPUTE GX-SFLRECNBR = WS-FIRST-SFL-REC +
                              WS-ROW-POS - 
                              GX-SFL-UR
       MOVE 0 TO #1
       MOVE SPACES TO #2
    END-EVALUATE
    IF GX-SFLRECNBR = 0
       MOVE 1 TO GX-SFLRECNBR
    END-IF.
