GX-ADJUST-INPUT-DTIME.
    MOVE CORR GX-INT-FMT-DTIME TO GX-INT-FMT-DATE
    PERFORM GX-ADJUST-INPUT-DATE
    MOVE CORR GX-INT-FMT-DATE TO GX-INT-FMT-DTIME.
