     A* GeneXus Logon Screen
     A* ARTech Ltd.
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'Return to PC')
     A                                      CA12(12 'Exit GENEXUS remain in the-
     A                                       AS/400')
     A          R GXSTRUP
     A                                  7 33'GeneXus (tm)'
     A            CURGXD        30A  O  9 31
     A                                 10 30'Library Version'
     A            CURGXV         7A  O 10 46
     A                                 12 36'ARTech'
     A                                 13 25'Advanced Research & Technology'
     A                                 15 29'Copyright ARTech Ltd.'
     A                                 16 29'All rights reserved.'
     A                                 18  2'Application . . . . . . . . . .'
     A            APPNAME       30A  O 18 36
     A                                 19  2'Data library. . . . . . . . . .'
     A            DTALIB        10A  O 19 36
     A                                 20  2'Programs library. . . . . . . .'
     A            PGMLIB        10A  O 20 36
     A                                 22  2'Enter=Start   F3=Exit   F12=Cancel'
     A                                      COLOR(BLU)
     A          R GXUPDI
     A                                  1 02'GeneXus (tm) update information'
     A                                  3 02'Installed version is .:'
     A            CURGXV         7A  O  3 26
     A            CURGXD        30A  O  3 34
     A                                  4 02'Required version is. .:'
     A            GXVERS         7A  O  4 26
     A                                 22  2'Enter=Update  F3=Exit   F12=Cancel'
     A                                      COLOR(BLU)
