GX-CALL-ERROR.

    MOVE 'GXM9999' TO GX-MSGID
    MOVE SPACES    TO GX-MSGDTA
    STRING #1 GX-ERRPGM '.'
           DELIMITED BY SIZE INTO GX-MSGDTA
    GO TO GX-ABORT.
