     A                                      COLHDG(+
     A                                      '#1' +
     A                                      )    
