CLR-SCREEN.
    MOVE 'CLRSCR'           TO GX-WS-FMT
    PERFORM WRITE-SCREEN.
WRITE-SCREEN.
    IF GX-ALARM NOT EQUAL 0
       SET ALARM-ON TO TRUE
    ELSE
       SET ALARM-OFF TO TRUE
    END-IF
    MOVE SUBFILE-FLAGS      TO SUBFILE-INDICATORS
    MOVE MISCELANEOUS-FLAGS TO MISCELANEOUS-INDICATORS
    WRITE GX-CRT-RECORD
          FORMAT IS GX-WS-FMT
          INDICATORS ARE GX-INDICATORS.
READ-SCREEN. 
    SET MORE-SFL-REC TO TRUE
    READ GX-CRT-FILE
        FORMAT IS GX-WS-FMT
        INDICATORS ARE GX-INDICATORS
    ACCEPT WS-FEEDBACK-AREA FROM DISPLAY-FEEDBACK
    MOVE WS-ROW TO WS-ROW-BYTE-HEX
    MOVE WS-COL TO WS-COL-BYTE-HEX
    MOVE WS-AID TO WS-AID-BYTE-HEX
    MOVE ZEROES TO GX-ALARM
    MOVE ZEROES TO GX-ATT-IND.
GX-MSG-MANAGER.
    IF MSG-COUNTER NOT GREATER ZERO
       MOVE SPACES TO MSG-DESCRIPTION
       PERFORM GX-ADD-MSG
    END-IF

    SET  DISPLAY-SFLCTL     TO TRUE
    SET  NO-SFL-END         TO TRUE
    SET  NO-DISPLAY-SFL     TO TRUE
    MOVE 'INFLIN'           TO GX-WS-FMT
    PERFORM WRITE-SCREEN

    MOVE MSG-COUNTER TO MSG-COUNTER-LOOP
    PERFORM UNTIL MSG-COUNTER-LOOP EQUAL ZERO
       MOVE MSG-COUNTER-LOOP TO GX-SFLRELRECNBR
       MOVE MSG-TEXT (MSG-COUNTER-LOOP) TO MSGTXT OF MSGREC-O
       IF ERROR-MSG (MSG-COUNTER-LOOP)
          SET RECORD-HAS-ERRORS TO TRUE
       ELSE
          SET RECORD-HAS-NO-ERRORS TO TRUE
       END-IF
       MOVE SUBFILE-FLAGS      TO SUBFILE-INDICATORS
       MOVE MISCELANEOUS-FLAGS TO MISCELANEOUS-INDICATORS
       WRITE SUBFILE GX-CRT-RECORD
             FORMAT IS 'MSGREC'
             INDICATORS ARE GX-INDICATORS
             INVALID KEY CONTINUE
       END-WRITE
       SUBTRACT 1 FROM MSG-COUNTER-LOOP
    END-PERFORM

    SET  DISPLAY-SFLCTL     TO TRUE
    SET  DISPLAY-SFL        TO TRUE
    SET  SFL-END            TO TRUE
    MOVE 'INFLIN'           TO GX-WS-FMT
    PERFORM WRITE-SCREEN
    MOVE ZERO               TO MSG-COUNTER.
GX-ADD-MSG.
    ADD 1 TO MSG-COUNTER
    IF MSG-COUNTER GREATER 100
       MOVE 100 TO MSG-COUNTER
    END-IF
    MOVE MSG-DESCRIPTION TO MSG-TEXT (MSG-COUNTER)
    SET WARNING-MSG (MSG-COUNTER) TO TRUE.
GX-ADD-ERR-MSG.
    PERFORM GX-ADD-MSG
    SET ERROR-MSG (MSG-COUNTER) TO TRUE.
SEND-ERROR-MSG-WS.
    PERFORM GX-ADD-ERR-MSG
    SET RECORD-HAS-ERRORS TO TRUE
    IF NO-ERRORS-FOUND
       MOVE GX-SFLRELRECNBR TO GX-SFLRECNBR
       SET ERRORS-FOUND TO TRUE
    END-IF.
