GX-ADDMT.
    MOVE GX-ADDMT-INDATE TO GX-ADDMT-OUTDATE

    IF YY OF GX-ADDMT-INDATE GREATER 1 OR
       MM OF GX-ADDMT-INDATE GREATER 1 OR
       DD OF GX-ADDMT-INDATE GREATER 1

       ADD MM OF GX-ADDMT-OUTDATE TO GX-ADDMT-INNUM
       DIVIDE GX-ADDMT-INNUM BY 12
              GIVING GX-ADDMT-Y
              REMAINDER GX-ADDMT-M
       ADD GX-ADDMT-Y TO YY OF GX-ADDMT-OUTDATE
       IF GX-ADDMT-M < 0
          ADD 12 TO GX-ADDMT-M
          SUBTRACT 1 FROM YY OF GX-ADDMT-OUTDATE
       END-IF
       IF GX-ADDMT-M = 0
          MOVE 12 TO GX-ADDMT-M
          SUBTRACT 1 FROM YY OF GX-ADDMT-OUTDATE
       END-IF
       MOVE GX-ADDMT-M TO MM OF GX-ADDMT-OUTDATE
       MOVE CORR GX-ADDMT-OUTDATE TO GX-TDTE-INDATE
       PERFORM GX-TDTE
       PERFORM UNTIL GX-TDTE-OUTNUM = 1
          SUBTRACT 1 FROM DD OF GX-ADDMT-OUTDATE
          MOVE CORR GX-ADDMT-OUTDATE TO GX-TDTE-INDATE
          PERFORM GX-TDTE
       END-PERFORM
    END-IF.
