GX-AGE.
    MOVE ZEROES TO GX-AGE-OUTNUM
    IF (YY OF GX-AGE-BDATE GREATER 1 OR
        MM OF GX-AGE-BDATE GREATER 1 OR
        DD OF GX-AGE-BDATE GREATER 1) AND
       (YY OF GX-AGE-TDATE GREATER 1 OR
        MM OF GX-AGE-TDATE GREATER 1 OR
        DD OF GX-AGE-TDATE GREATER 1)

       COMPUTE GX-AGE-OUTNUM = YY OF GX-AGE-TDATE -
                               YY OF GX-AGE-BDATE
       IF GX-AGE-OUTNUM GREATER ZERO
          IF GX-AGE-BDATE-TAIL GREATER GX-AGE-TDATE-TAIL
             SUBTRACT 1 FROM GX-AGE-OUTNUM
          END-IF
       ELSE
          IF GX-AGE-OUTNUM LESS ZERO AND
             GX-AGE-TDATE-TAIL GREATER GX-AGE-BDATE-TAIL
             ADD 1 TO GX-AGE-OUTNUM
          END-IF
       END-IF
    END-IF.
