01  GX-AGE-BDATE.
    05 YY                          PIC  9(004).
    05 GX-AGE-BDATE-TAIL.
       10 FILLER                   PIC  X(001).
       10 MM                       PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 DD                       PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 HH                       PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 MIN                      PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 SS                       PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 MS                       PIC  X(006).
01  GX-AGE-TDATE.
    05 YY                          PIC  9(004).
    05 GX-AGE-TDATE-TAIL.
       10 FILLER                   PIC  X(001).
       10 MM                       PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 DD                       PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 HH                       PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 MIN                      PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 SS                       PIC  9(002).
       10 FILLER                   PIC  X(001).
       10 MS                       PIC  X(006).
01  GX-AGE-OUTNUM                  PIC S9(005) COMP-3.
