01  GX-ADDMT-INDATE.
    02 YY                          PIC  9(004).
    02 FILLER                      PIC  X(001) VALUE '-'.
    02 MM                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '-'.
    02 DD                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '-'.
    02 HH                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 MIN                         PIC  99.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 SS                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 MS                          PIC  X(006) VALUE '000000'.
01  GX-ADDMT-INNUM                 PIC S9(007) COMP-3.
01  GX-ADDMT-Y                     PIC S9(007) COMP-3.
01  GX-ADDMT-M                     PIC S9(003) COMP-3.
01  GX-ADDMT-OUTDATE.
    02 YY                          PIC  9(004).
    02 FILLER                      PIC  X(001) VALUE '-'.
    02 MM                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '-'.
    02 DD                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '-'.
    02 HH                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 MIN                         PIC  99.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 SS                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 MS                          PIC  X(006) VALUE '000000'.
