GX-ADDYR.
    MOVE GX-ADDYR-INDATE TO GX-ADDMT-INDATE
    COMPUTE GX-ADDMT-INNUM = GX-ADDYR-INNUM * 12
    PERFORM GX-ADDMT
    MOVE GX-ADDMT-OUTDATE TO GX-ADDYR-OUTDATE.
