GX-CONCAT.
    MOVE SPACES    TO GX-CAT-OUTPUT
    MOVE 1         TO GX-CAT-POINTER
    MOVE 256       TO GX-LENGTH-ML
    MOVE GX-CAT-C1 TO GX-LENGTH-C
    PERFORM GX-LENGTH
    IF GX-LENGTH-L > 0
       STRING GX-CAT-C1 (1 : GX-LENGTH-L) DELIMITED BY SIZE
              INTO GX-CAT-OUTPUT POINTER GX-CAT-POINTER
    END-IF
    IF GX-CAT-C3L > 0
       IF GX-CAT-C3L > 256
          MOVE 256 TO GX-CAT-C3L
       END-IF
       STRING GX-CAT-C3 (1 : GX-CAT-C3L) DELIMITED BY SIZE
              INTO GX-CAT-OUTPUT POINTER GX-CAT-POINTER
    END-IF
    STRING GX-CAT-C2 DELIMITED BY SIZE
           INTO GX-CAT-OUTPUT POINTER GX-CAT-POINTER.
