01  GX-CAT-OUTPUT                  PIC  X(300).
01  GX-CAT-C1                      PIC  X(256).
01  GX-CAT-C2                      PIC  X(256).
01  GX-CAT-C3                      PIC  X(256).
01  GX-CAT-C3L                     PIC S9(003) COMP-3.
01  GX-CAT-POINTER                 PIC S9(003) COMP-3.
