GX-CTOD.

    MOVE ZEROES TO GX-CTOD-D
    UNSTRING GX-CTOD-C DELIMITED BY '/' OR '-' OR ' '
        INTO #1 OF GX-CTOD-D COUNT IN GX-CTOD-#1-L
             #2 OF GX-CTOD-D COUNT IN GX-CTOD-#2-L
             #3 OF GX-CTOD-D COUNT IN GX-CTOD-#3-L
    INSPECT GX-CTOD-D REPLACING ALL ' ' BY '0'

    MOVE ZEROES TO GX-INT-FMT-DATE
    IF YY OF GX-CTOD-D NUMERIC AND
       MM OF GX-CTOD-D NUMERIC AND
       DD OF GX-CTOD-D NUMERIC

       IF GX-CTOD-YY-L LESS 5 AND GX-CTOD-YY-L GREATER 0 AND
          GX-CTOD-MM-L LESS 3 AND GX-CTOD-MM-L GREATER 0 AND
          GX-CTOD-DD-L LESS 3 AND GX-CTOD-DD-L GREATER 0

          MOVE CORR GX-CTOD-D TO GX-INT-FMT-DATE
       END-IF
    END-IF
    PERFORM GX-ADJUST-INPUT-DATE
    MOVE GX-INT-FMT-DATE TO GX-CTOD-D
    MOVE GX-CTOD-D TO GX-TDTE-INDATE
    PERFORM GX-TDTE
    IF GX-TDTE-OUTNUM = 0
       MOVE ZEROES TO GX-CTOD-D
    END-IF.

