01  GX-CTOD-C                      PIC  X(010).
01  GX-CTOD-D.
    05 YY                          PIC  X(004) JUST.
    05 MM                          PIC  X(002) JUST.
    05 DD                          PIC  X(002) JUST.
01  GX-CTOD-YY-L                   PIC  9(002).
01  GX-CTOD-MM-L                   PIC  9(002).
01  GX-CTOD-DD-L                   PIC  9(002).

