GX-DOW.
    MOVE GX-DOW-INDATE TO GX-DTON-INDATE
    PERFORM GX-DTON
    MOVE ZERO TO GX-DOW-OUTNUM
    IF GX-DTON-OUTNUM NOT EQUAL ZERO
       ADD 2 TO GX-DTON-OUTNUM
       DIVIDE GX-DTON-OUTNUM BY 7 GIVING GX-DTON-UF
                                 REMAINDER GX-DOW-OUTNUM
       ADD 1 TO GX-DOW-OUTNUM
    END-IF.
