01  GX-DOW-INDATE                  PIC  X(008).
01  GX-DTON-UF                     PIC S9(009) COMP-3.
01  GX-DOW-OUTNUM                  PIC S9(001) COMP-3.
