01  GX-DTON-INDATE.
    02 YY                          PIC  9(004).
    02 MM                          PIC  99.
    02 DD                          PIC  99.
01  GX-DTON-D                      PIC S9(007) COMP-3.
01  GX-DTON-L-4                    PIC S9(007) COMP-3.
01  GX-DTON-L-400                  PIC S9(007) COMP-3.
01  GX-DTON-L-100                  PIC S9(007) COMP-3.
01  GX-DTON-DW.
    02 YY                          PIC S9(005) COMP-3.
    02 MM                          PIC S9(003) COMP-3.
    02 DD                          PIC S9(003) COMP-3.
01  GX-DTON-OUTNUM                 PIC S9(009) COMP-3.
