01  GX-DAY-D.
    05 FILLER                      PIC  X(004).
    05 FILLER                      PIC  X(002).
    05 GX-DAY-DD                   PIC  9(002).


