01  GX-DA-IN-C                     PIC  X(3000).
01  GX-DA-IN-L                     PIC S9(005) COMP-3.
01  GX-DA-IN-M                     PIC S9(005) COMP-3.
01  GX-DA-J                        PIC S9(005) COMP-3.
01  GX-DA-K                        PIC S9(005) COMP-3.
01  GX-DA-I                        PIC S9(005) COMP-3.
01  GX-DA-F                        PIC S9(001) COMP-3.
01  GX-DA-OUT-L                    PIC S9(005) COMP-3.
01  GX-DA-OUT-C                    PIC  X(3000).
