01  GX-DTOC-D.
    05 YY                          PIC  9(004).
    05 MM                          PIC  9(002).
    05 DD                          PIC  9(002).
01  GX-DTOC-C.
    05 #1                          PIC  9(002).
    05 FILLER                      PIC  X(001) VALUE '/'.
    05 #2                          PIC  9(002).
    05 FILLER                      PIC  X(001) VALUE '/'.
    05 #3                          PIC  9(002).
