GX-DTTON.
    IF YY OF GX-DTTON-INDT = 1 AND
       MM OF GX-DTTON-INDT = 1 AND
       DD OF GX-DTTON-INDT = 1

       MOVE 0 TO GX-DTTON-OUTNUM
    ELSE
       MOVE CORR GX-DTTON-INDT TO GX-DTON-INDATE
       PERFORM GX-DTON
       MOVE GX-DTON-OUTNUM TO GX-DTTON-OUTNUM
    END-IF
    COMPUTE GX-DTTON-OUTNUM = GX-DTTON-OUTNUM +
       ( HH OF GX-DTTON-INDT * 3600 +
         MIN OF GX-DTTON-INDT * 60 +
         SS OF GX-DTTON-INDT) / 100000.

