GX-EOM.
    MOVE GX-EOM-INDATE TO GX-EOM-OUTDATE
    IF YY OF GX-EOM-INDATE GREATER 1 OR
       MM OF GX-EOM-INDATE GREATER 1 OR
       DD OF GX-EOM-INDATE GREATER 1
       IF GX-EOM-31-DM
          MOVE 31 TO DD OF GX-EOM-OUTDATE
       ELSE IF GX-EOM-2-M
          MOVE 30 TO DD OF GX-EOM-OUTDATE
          PERFORM TEST AFTER UNTIL GX-TDTE-OUTNUM = 1
             SUBTRACT 1 FROM DD OF GX-EOM-OUTDATE
             MOVE CORR GX-EOM-OUTDATE TO GX-TDTE-INDATE
             PERFORM GX-TDTE
          END-PERFORM
       ELSE
          MOVE 30 TO DD OF GX-EOM-OUTDATE
       END-IF
       END-IF
       MOVE 23 TO HH OF GX-EOM-OUTDATE
       MOVE 59 TO MIN OF GX-EOM-OUTDATE
       MOVE 59 TO SS OF GX-EOM-OUTDATE
    END-IF.
