01  GX-EOM-INDATE.
    02 YY                          PIC  9(004).
    02 FILLER                      PIC  X(001).
    02 MM                          PIC  9(002).
    02 FILLER                      PIC  X(001).
    02 DD                          PIC  9(002).
    02 FILLER                      PIC  X(001).
    02 HH                          PIC  9(002).
    02 FILLER                      PIC  X(001).
    02 MIN                         PIC  9(002).
    02 FILLER                      PIC  X(001).
    02 SS                          PIC  9(002).
    02 FILLER                      PIC  X(001).
    02 MS                          PIC  X(006).
01  GX-EOM-OUTDATE.
    02 YY                          PIC  9(004).
    02 FILLER                      PIC  X(001).
    02 MM                          PIC  9(002).
       88 GX-EOM-31-DM    VALUE 1, 3, 5, 7, 8, 10, 12.
       88 GX-EOM-2-M      VALUE 2.
    02 FILLER                      PIC  X(001).
    02 DD                          PIC  9(002).
    02 FILLER                      PIC  X(001).
    02 HH                          PIC  9(002).
    02 FILLER                      PIC  X(001).
    02 MIN                         PIC  9(002).
    02 FILLER                      PIC  X(001).
    02 SS                          PIC  9(002).
    02 FILLER                      PIC  X(001).
    02 MS                          PIC  X(006).
