GX-LENGTH.
    MOVE 0 TO GX-LENGTH-L.
    IF GX-LENGTH-ML < 0 MOVE 0 TO GX-LENGTH-ML.
    PERFORM UNTIL GX-LENGTH-L = GX-LENGTH-ML
       COMPUTE GX-LENGTH-F = (GX-LENGTH-ML - GX-LENGTH-L) / 2 +
                             GX-LENGTH-L + 1
       COMPUTE GX-LENGTH-T = GX-LENGTH-ML - GX-LENGTH-F + 1
       IF GX-LENGTH-C (GX-LENGTH-F : GX-LENGTH-T) = SPACES
          COMPUTE GX-LENGTH-ML = GX-LENGTH-F - 1
       ELSE
          COMPUTE GX-LENGTH-L = GX-LENGTH-F
       END-IF
    END-PERFORM.
