GX-LTRIM.
    MOVE 1 TO GX-LTRIM-START
    INSPECT GX-LTRIM-STRING
            TALLYING GX-LTRIM-START FOR LEADING SPACES
    IF GX-LTRIM-START > GX-LTRIM-MAX MOVE 1 TO GX-LTRIM-START END-IF
    MOVE GX-LTRIM-STRING (GX-LTRIM-START: ) TO GX-LTRIM-OUT.
