01  GX-LTRIM-MAX                   PIC S9(003) COMP-3 VALUE 256.
01  GX-LTRIM-STRING                PIC  X(256).
01  GX-LTRIM-START                 PIC S9(003) COMP-3.
01  GX-LTRIM-OUT                   PIC  X(256).
