01  GX-LENGTH-C                    PIC  X(3000).
01  GX-LENGTH-ML                   PIC S9(005) COMP-3.
01  GX-LENGTH-L                    PIC S9(005) COMP-3.
01  GX-LENGTH-T                    PIC S9(005) COMP-3.
01  GX-LENGTH-F                    PIC S9(005) COMP-3.
