01  GX-LIKE-STRING                 PIC  X(0999).
01  GX-LIKE-STRING-LEN             PIC S9(0003) COMP-3.
01  GX-LIKE-PTRN                   PIC  X(0999).
01  GX-LIKE-PTRN-LEN               PIC S9(0003) COMP-3.
01  GX-LIKE-RESULT                 PIC S9(0003) COMP-3.
