01  GX-MONTH-D.
    05 FILLER                      PIC  X(004).
    05 GX-MONTH-MM                 PIC  9(002).
    05 FILLER                      PIC  X(002).


