01  GX-NTOD-INNUM                  PIC S9(009) COMP-3.
01  GX-NTOD-TMP                    PIC S9(007) COMP-3.
01  GX-NTOD-JUL                    PIC S9(007) COMP-3.
01  GX-NTOD-CNTRY                  PIC S9(007) COMP-3.
01  GX-NTOD-Y                      PIC S9(005) COMP-3.
01  GX-NTOD-M                      PIC S9(003) COMP-3.
01  GX-NTOD-D                      PIC S9(003) COMP-3.
01  GX-NTOD-OUTDATE.
    03 YY                          PIC  9(004).
    03 MM                          PIC  99.
    03 DD                          PIC  99.
