01  GX-NTOT-INNUM                  PIC S9(009)V9(005) COMP-3.
01  GX-NTOT-OUTDT.
    02 YY                          PIC  9(004).
    02 FILLER                      PIC  X(001) VALUE '-'.
    02 MM                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '-'.
    02 DD                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '-'.
    02 HH                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 MIN                         PIC  99.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 SS                          PIC  99.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 MS                          PIC  X(006) VALUE '000000'.

01  GX-NTOT-NTIME                  PIC S9(005) COMP-3.
01  GX-NTOT-TNUM                   PIC S9(003) COMP-3.
