GX-NTOD.
    MOVE ZERO TO GX-NTOD-OUTDATE
    IF GX-NTOD-INNUM > ZERO
       MOVE GX-NTOD-INNUM TO GX-NTOD-JUL
       COMPUTE GX-NTOD-CNTRY = (GX-NTOD-JUL * 100 - 20) / 3652425
       COMPUTE GX-NTOD-TMP = GX-NTOD-CNTRY / 4
       COMPUTE GX-NTOD-JUL = GX-NTOD-JUL + GX-NTOD-CNTRY - GX-NTOD-TMP
       COMPUTE GX-NTOD-Y = (GX-NTOD-JUL * 100 - 20) / 36525
       COMPUTE GX-NTOD-TMP = ( 36525 * GX-NTOD-Y) / 100
       COMPUTE GX-NTOD-JUL = GX-NTOD-JUL - GX-NTOD-TMP
       COMPUTE GX-NTOD-M = (GX-NTOD-JUL * 10 - 5) / 306
       COMPUTE GX-NTOD-D = (GX-NTOD-JUL * 10 - 306 * GX-NTOD-M + 5) / 10
       IF GX-NTOD-M LESS 10
          ADD 3 TO GX-NTOD-M
       ELSE
          SUBTRACT 9 FROM GX-NTOD-M
          ADD 1 TO GX-NTOD-Y
       END-IF
       MOVE GX-NTOD-Y TO YY OF GX-NTOD-OUTDATE
       MOVE GX-NTOD-M TO MM OF GX-NTOD-OUTDATE
       MOVE GX-NTOD-D TO DD OF GX-NTOD-OUTDATE
    END-IF.
