GX-NOW.

    PERFORM GX-SYSDATE
    MOVE GX-SYSDATE-D(1:4) TO YY OF GX-NOW-OUTDT
    MOVE GX-SYSDATE-D(5:2) TO MM OF GX-NOW-OUTDT
    MOVE GX-SYSDATE-D(7:2) TO DD OF GX-NOW-OUTDT

    PERFORM GX-SYSTIME
    MOVE HH OF GX-TIME TO HH OF GX-NOW-OUTDT
    MOVE MM OF GX-TIME TO MIN OF GX-NOW-OUTDT
    MOVE SS OF GX-TIME TO SS OF GX-NOW-OUTDT.
