GX-NTOT.

    MOVE GX-NTOT-INNUM TO GX-NTOD-INNUM
    PERFORM GX-NTOD
    IF YY OF GX-NTOD-OUTDATE = 0 AND
       MM OF GX-NTOD-OUTDATE = 0 AND
       DD OF GX-NTOD-OUTDATE = 0

       MOVE '0001' TO YY OF GX-NTOT-OUTDT
       MOVE '01'   TO MM OF GX-NTOT-OUTDT
       MOVE '01'   TO DD OF GX-NTOT-OUTDT
    ELSE
       MOVE YY OF GX-NTOD-OUTDATE TO YY OF GX-NTOT-OUTDT
       MOVE MM OF GX-NTOD-OUTDATE TO MM OF GX-NTOT-OUTDT
       MOVE DD OF GX-NTOD-OUTDATE TO DD OF GX-NTOT-OUTDT
    END-IF

    COMPUTE GX-NTOT-NTIME = GX-NTOT-INNUM * 100000

    COMPUTE GX-NTOT-TNUM = GX-NTOT-NTIME / 3600
    MOVE GX-NTOT-TNUM TO HH OF GX-NTOT-OUTDT
    COMPUTE GX-NTOT-NTIME = GX-NTOT-NTIME - GX-NTOT-TNUM * 3600

    COMPUTE GX-NTOT-TNUM = GX-NTOT-NTIME / 60
    MOVE GX-NTOT-TNUM TO MIN OF GX-NTOT-OUTDT
    COMPUTE GX-NTOT-NTIME = GX-NTOT-NTIME - GX-NTOT-TNUM * 60

    MOVE GX-NTOT-NTIME TO SS OF GX-NTOT-OUTDT.

