GX-SYSDATE.

    MOVE '*CURRENT' TO GX-SYSDATE-CVT-INFMT
    MOVE SPACES TO GX-SYSDATE-CVT-INVAL
    MOVE '*YYMD' TO GX-SYSDATE-CVT-OUTFMT
    MOVE LOW-VALUE TO GX-SYSDATE-CVT-ERROR
    MOVE ZEROES TO GX-BYTES-PROVIDED OF GX-SYSDATE-CVT-ERROR
    CALL 'QWCCVTDT' USING GX-SYSDATE-CVT-INFMT
                          GX-SYSDATE-CVT-INVAL
                          GX-SYSDATE-CVT-OUTFMT
                          GX-SYSDATE-CVT-OUTVAL
                          GX-SYSDATE-CVT-ERROR
    MOVE GX-SYSDATE-CVT-OUTVAL TO GX-SYSDATE-D.
