01  GX-SUBSTR-STRING               PIC  X(256).
01  GX-SUBSTR-START                PIC S9(003) COMP-3.
01  GX-SUBSTR-LEN                  PIC S9(003) COMP-3.
01  GX-SUBSTR-OUT                  PIC  X(256).
