01  GX-STR-OUTPUT                  PIC  X(20).
01  GX-STR-NUM                     PIC S9(16)V9(2) COMP-3.
01  GX-STR-ENUM                    PIC  -(16)9#1.
01  GX-STR-LEN                     PIC  9(003).
01  GX-STR-DEC                     PIC  9(003).
01  GX-STR-MAX                     PIC S9(16)V9(2) COMP-3.
01  GX-STR-MIN                     PIC S9(16)V9(2) COMP-3.
01  GX-STR-START                   PIC S9(003).
