01  GX-TIME-S.
    05 HH                          PIC  X(002).
    05 MM                          PIC  X(002).
    05 SS                          PIC  X(002).
    05 CC                          PIC  X(002).
01  GX-TIME.
    05 HH                          PIC  X(002).
    05 FILLER                      PIC  X(001) VALUE ':'.
    05 MM                          PIC  X(002).
    05 FILLER                      PIC  X(001) VALUE ':'.
    05 SS                          PIC  X(002).

