01  GX-TDTIME-INDT.
    02 YY                          PIC  X(004) JUST.
    02 FILLER                      PIC  X(001).
    02 MM                          PIC  X(002) JUST.
    02 FILLER                      PIC  X(001).
    02 DD                          PIC  X(002) JUST.
    02 FILLER                      PIC  X(001).
    02 HH                          PIC  X(002) JUST.
    02 FILLER                      PIC  X(001).
    02 MIN                         PIC  X(002) JUST.
    02 FILLER                      PIC  X(001).
    02 SS                          PIC  X(002) JUST.
    02 FILLER                      PIC  X(001) VALUE '.'.
    02 MS                          PIC  X(006) VALUE '000000'.
01  GX-TDTIME-OUTNUM               PIC S9(001) COMP-3.
