GX-TDIFF.

    MOVE GX-TDIFF-LDT TO GX-DTTON-INDT
    PERFORM GX-DTTON
    MOVE GX-DTTON-OUTNUM TO GX-TDIFF-DAYSEC

    COMPUTE GX-TDIFF-OUTN = GX-TDIFF-DAYS * 86400 + GX-TDIFF-SECS

    MOVE GX-TDIFF-RDT TO GX-DTTON-INDT
    PERFORM GX-DTTON
    MOVE GX-DTTON-OUTNUM TO GX-TDIFF-DAYSEC

    COMPUTE GX-TDIFF-OUTN = GX-TDIFF-OUTN -
                            (GX-TDIFF-DAYS * 86400 + GX-TDIFF-SECS).
