01  GX-TDAY-DATE                   PIC  9(008).
01  GX-TDAY-ADJ                    PIC  X(002).
01  GX-TDAY-SW                     PIC  9(001) VALUE 0.
