GX-TDTIME.
    MOVE 0 TO GX-TDTIME-OUTNUM
    IF YY OF GX-TDTIME-INDT NUMERIC AND
       MM OF GX-TDTIME-INDT NUMERIC AND
       DD OF GX-TDTIME-INDT NUMERIC 

       MOVE CORR GX-TDTIME-INDT TO GX-TDTE-INDATE
       PERFORM GX-TDTE
       MOVE GX-TDTE-OUTNUM TO GX-TDTIME-OUTNUM
       IF GX-TDTIME-OUTNUM = 1 AND
          HH  OF GX-TDTIME-INDT NUMERIC AND
          MIN OF GX-TDTIME-INDT NUMERIC AND
          SS  OF GX-TDTIME-INDT NUMERIC AND
          HH  OF GX-TDTIME-INDT LESS 24 AND
          MIN OF GX-TDTIME-INDT LESS 60 AND
          SS  OF GX-TDTIME-INDT LESS 60

          CONTINUE
       ELSE
          MOVE 0 TO GX-TDTIME-OUTNUM
       END-IF
    END-IF.
