GX-TADD.

    MOVE GX-TADD-DT TO GX-DTTON-INDT
    PERFORM GX-DTTON
    MOVE GX-DTTON-OUTNUM TO GX-TADD-DAYSEC

    DIVIDE GX-TADD-SEC BY 86400 GIVING GX-TADD-TDAY
                                REMAINDER GX-TADD-TSEC

    ADD GX-TADD-DAYS TO GX-TADD-TDAY
    ADD GX-TADD-SECS TO GX-TADD-TSEC
    IF GX-TADD-TSEC LESS 0
       ADD 86400 TO GX-TADD-TSEC
       SUBTRACT 1 FROM GX-TADD-TDAY
    ELSE IF GX-TADD-TSEC NOT LESS 86400
       ADD 1 TO GX-TADD-TDAY
       SUBTRACT 86400 FROM GX-TADD-TSEC
    END-IF
    END-IF
    COMPUTE GX-TADD-TSEC = GX-TADD-TSEC / 100000
    
    MOVE GX-TADD-TDAY TO GX-NTOT-INNUM
    ADD GX-TADD-TSEC TO GX-NTOT-INNUM
    PERFORM GX-NTOT
    MOVE GX-NTOT-OUTDT TO GX-TADD-OUTDT.
