01  GX-VAL-STR                     PIC  X(064).
01  GX-VAL-VAL                     PIC S9(#2)V9(2).

01  GX-VAL-INT                     PIC S9(#1).
01  GX-VAL-DEC                     PIC S9(#1).
01  GX-VAL-DECCNT                  PIC S9(003) COMP-3.
01  GX-VAL-PTR                     PIC S9(005) COMP-3.
01  GX-VAL-IDX                     PIC S9(005) COMP-3.
01  GX-VAL-W-STR                   PIC  X(033).
01  GX-VAL-CHAR                    PIC  X(001).
01  GX-VAL-SIGN                    PIC  X(001).
