01  GX-XTD-YY                      PIC  9(004).
01  GX-XTD-MM                      PIC  9(002).
01  GX-XTD-DD                      PIC  9(002).
01  GX-XTD-D.
    05 YY                          PIC  9(004).
    05 MM                          PIC  9(002).
    05 DD                          PIC  9(002).
