GX-XTD.

    MOVE GX-XTD-YY TO YY OF GX-XTD-D
    MOVE GX-XTD-MM TO MM OF GX-XTD-D
    MOVE GX-XTD-DD TO DD OF GX-XTD-D
    MOVE CORR GX-XTD-D TO GX-INT-FMT-DATE
    PERFORM GX-ADJUST-INPUT-DATE
    MOVE GX-INT-FMT-DATE TO GX-XTD-D
                            GX-TDTE-INDATE
    PERFORM GX-TDTE
    IF GX-TDTE-OUTNUM = 0
       MOVE ZEROES TO GX-XTD-D
    END-IF
    CONTINUE.
