GX-YMDHMSTOT.

    MOVE CORR GX-YMDHMSTOT-DT TO GX-TDTIME-INDT
    PERFORM GX-TDTIME
    IF GX-TDTIME-OUTNUM = 0
       MOVE 1 TO YY OF GX-YMDHMSTOT-DT
       MOVE 1 TO MM OF GX-YMDHMSTOT-DT
       MOVE 1 TO DD OF GX-YMDHMSTOT-DT
       MOVE 0 TO HH OF GX-YMDHMSTOT-DT
       MOVE 0 TO MIN OF GX-YMDHMSTOT-DT
       MOVE 0 TO SS OF GX-YMDHMSTOT-DT
    ELSE
       MOVE CORR GX-YMDHMSTOT-DT TO GX-INT-FMT-DTIME
       PERFORM GX-ADJUST-INPUT-DTIME
       MOVE CORR GX-INT-FMT-DTIME TO GX-YMDHMSTOT-DT
    END-IF.
