01  GX-YEAR-D.
    05 GX-YEAR-YY                  PIC  9(004).
    05 FILLER                      PIC  X(002).
    05 FILLER                      PIC  X(002).


