GX-IOERR.

    MOVE SPACES TO MSG-DESCRIPTION
    EVALUATE TRUE
       WHEN GX-IO-OK OR GX-IO-EOF
          CONTINUE
       WHEN GX-IO-LOCKED-FILE OR
            GX-IO-LOCKED-RCD
          STRING #1 GX-IO-XFI
              DELIMITED BY SIZE INTO MSG-DESCRIPTION
          PERFORM SEND-ERROR-MSG-WS
       WHEN OTHER
          STRING #2 V-FS ') ' GX-IO-OP ' ' GX-IO-XFI
             DELIMITED BY SIZE INTO MSG-DESCRIPTION
          PERFORM SEND-ERROR-MSG-WS
    END-EVALUATE.
