MOVE 'opening' TO GX-IO-OP
MOVE '#2' TO GX-IO-XFI
MOVE 0 TO GX-LOCK-COUNT
PERFORM TEST AFTER UNTIL GX-IO-CODE NOT LESS ZERO
   OPEN #1 #2
   PERFORM GX-FILE-STATUS-ANALYSIS
   PERFORM GX-IOERR-LOOP
END-PERFORM
