01  W-PRN-FEEDBACK.
    10 FILLER                PIC X(02).
    10 FILLER                PIC X(10).
    10 FILLER                PIC X(59).
    10 W-PRN-LPP             PIC 9(02)   COMP-4.
    10 FILLER                PIC 9(02)   COMP-4.
    10 FILLER                PIC X(32).
    10 W-PRN-OVERFLOW        PIC 9(02)   COMP-4.
