01  GX-OVRDBF.
    02 FILLER                   PIC X(012) VALUE 'OVRDBF FILE('.
    02 GX-ODBF-FILE             PIC X(021).
    02 FILLER                   PIC X(009) VALUE ') TOFILE('.
    02 GX-ODBF-TOFILE           PIC X(021).
    02 FILLER                   PIC X(008) VALUE ') SHARE('.
    02 GX-ODBF-SHARE            PIC X(004).
    02 FILLER                   PIC X(009) VALUE ') LVLCHK('.
    02 GX-ODBF-LVLCHK           PIC X(004).
    02 FILLER                   PIC X(010) VALUE ') WAITRCD('.
    02 GX-ODBF-WAITRCD          PIC X(005).
    02 FILLER                   PIC X(001) VALUE ')'.
