MOVE 0 TO GX-LOCK-COUNT
MOVE 'reading' TO GX-IO-OP
PERFORM TEST AFTER UNTIL GX-IO-CODE NOT LESS ZERO
   READ #1 #2
      INVALID KEY
        CONTINUE
   END-READ
   PERFORM GX-FILE-STATUS-ANALYSIS
   PERFORM GX-IOERR-LOOP
END-PERFORM
