READ-SUBFILE-NEXT-MODIFIED.

    READ SUBFILE GX-CRT-FILE
         NEXT MODIFIED
         FORMAT IS GX-WS-FMT
         AT END
            SET NO-MORE-SFL-REC TO TRUE
    END-READ
    IF GX-WS-STATUS NOT EQUAL '00'
       SET NO-MORE-SFL-REC TO TRUE
    END-IF
    MOVE ZEROES TO GX-ATT-IND.
