READ-SUBFILE-EQ.

    READ SUBFILE GX-CRT-FILE
         FORMAT IS GX-WS-FMT
         INVALID KEY
            CONTINUE
    END-READ
    MOVE ZEROES TO GX-ATT-IND.
