SET  NO-INSRCD            TO TRUE
SET  NO-DELRCD            TO TRUE
SET  MODIFIED-MARK-OFF    TO TRUE
SET  RECORD-HAS-NO-ERRORS TO TRUE
SET  ALWAYS-ON            TO TRUE
MOVE ZEROES               TO GX-ALARM
MOVE ZEROES               TO GX-RST-SCR
MOVE ZEROES               TO GX-INDICATORS
MOVE ZEROES               TO WS-ROW-POS
MOVE ZEROES               TO WS-COL-POS,
MOVE ZEROES               TO WS-FIRST-SFL-REC
MOVE ZEROES               TO WS-AID-BYTE-REDEFINED
MOVE ZEROES               TO MSG-COUNTER
MOVE ZEROES               TO GX-SFLRELRECNBR
MOVE ZEROES               TO GX-S-CPOS

