01  GX-FLD-FLAG                    PIC  X.
    88 GX-KEY-FLD                              VALUE '1'.
    88 GX-NON-KEY-FLD                          VALUE '0'.

01  GX-SFL1STMOD                   PIC S9(005) COMP-3.
01  GX-CHK-OR-LD                   PIC S9(001) COMP-3.
01  GX-LCHK                        PIC S9(001) COMP-3.
