GX-CFRM.

    PERFORM #6
    MOVE #2 TO #3 OF #4
    MOVE #5  TO GX-WS-FMT
    PERFORM WRITE-SCREEN

    MOVE WS-AID-BYTE TO WS-AID-BYTE-SAVED
    PERFORM READ-SCREEN
        TEST AFTER
        UNTIL WS-KEY-ENTER OR #1
    IF WS-KEY-ENTER
       MOVE 1 TO GX-USR-CONFIRM
    ELSE
       MOVE 0 TO GX-USR-CONFIRM
    END-IF
    MOVE WS-AID-BYTE-SAVED TO WS-AID-BYTE
    CONTINUE.
