GX-WAITMSG.
    
    MOVE #1 TO #2 OF #3
    MOVE #4 TO GX-WS-FMT
    PERFORM WRITE-SCREEN
    MOVE WS-AID-BYTE TO WS-AID-BYTE-SAVED
    PERFORM READ-SCREEN
        TEST AFTER
        UNTIL WS-KEY-ENTER
    MOVE WS-AID-BYTE-SAVED TO WS-AID-BYTE
    CONTINUE.
