01  GX-MATCHING-FLAG PIC X.
    88 GX-MATCHING        VALUE '1'.
    88 GX-NO-MATCHING     VALUE '0'.
01  GX-RESTART-FLAG PIC X.
    88 GX-RESTART         VALUE '1'.
    88 GX-NO-RESTART      VALUE '0'.
01  GX-REPOSITION-FLAG PIC X.
    88 GX-REPOSITION      VALUE '1'.
    88 GX-NO-REPOSITION   VALUE '0'.
01  GX-LOADED-FLAG     PIC X.
    88 GX-LOADED          VALUE '1'.
    88 GX-NOT-LOADED      VALUE '0'.
