WRITE-SUBFILE.

    MOVE SUBFILE-FLAGS      TO SUBFILE-INDICATORS
    MOVE MISCELANEOUS-FLAGS TO MISCELANEOUS-INDICATORS
    WRITE SUBFILE GX-CRT-RECORD
          FORMAT IS GX-WS-FMT
          INDICATORS ARE GX-INDICATORS
          INVALID KEY
             CONTINUE
    END-WRITE.
